GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p16F18056.inc
;----- PORTB Bits -----------------------------------------------------
RB0              EQU  H'0000'
RB1              EQU  H'0001'
RB2              EQU  H'0002'
RB3              EQU  H'0003'
RB4              EQU  H'0004'
RB5              EQU  H'0005'
RB6              EQU  H'0006'
RB7              EQU  H'0007'


;----- PORTC Bits -----------------------------------------------------
RC0              EQU  H'0000'
RC1              EQU  H'0001'
RC2              EQU  H'0002'
RC3              EQU  H'0003'
RC4              EQU  H'0004'
RC5              EQU  H'0005'
RC6              EQU  H'0006'
RC7              EQU  H'0007'


;----- PORTE Bits -----------------------------------------------------
RE3              EQU  H'0003'


;----- TRISA Bits -----------------------------------------------------
TRISA0           EQU  H'0000'
TRISA1           EQU  H'0001'
TRISA2           EQU  H'0002'
TRISA3           EQU  H'0003'
TRISA4           EQU  H'0004'
TRISA5           EQU  H'0005'
TRISA6           EQU  H'0006'
TRISA7           EQU  H'0007'


;----- TRISB Bits -----------------------------------------------------
TRISB0           EQU  H'0000'
TRISB1           EQU  H'0001'
TRISB2           EQU  H'0002'
TRISB3           EQU  H'0003'
TRISB4           EQU  H'0004'
TRISB5           EQU  H'0005'
TRISB6           EQU  H'0006'
TRISB7           EQU  H'0007'


;----- TRISC Bits -----------------------------------------------------
TRISC0           EQU  H'0000'
TRISC1           EQU  H'0001'
TRISC2           EQU  H'0002'
TRISC3           EQU  H'0003'
TRISC4           EQU  H'0004'
TRISC5           EQU  H'0005'
TRISC6           EQU  H'0006'
TRISC7           EQU  H'0007'


;----- TRISE Bits -----------------------------------------------------
TRISE3           EQU  H'0003'


;----- LATA Bits -----------------------------------------------------
LATA0            EQU  H'0000'
LATA1            EQU  H'0001'
LATA2            EQU  H'0002'
LATA3            EQU  H'0003'
LATA4            EQU  H'0004'
LATA5            EQU  H'0005'
LATA6            EQU  H'0006'
LATA7            EQU  H'0007'


;----- LATB Bits -----------------------------------------------------
LATB0            EQU  H'0000'
LATB1            EQU  H'0001'
LATB2            EQU  H'0002'
LATB3            EQU  H'0003'
LATB4            EQU  H'0004'
LATB5            EQU  H'0005'
LATB6            EQU  H'0006'
LATB7            EQU  H'0007'


;----- LATC Bits -----------------------------------------------------
LATC0            EQU  H'0000'
LATC1            EQU  H'0001'
LATC2            EQU  H'0002'
LATC3            EQU  H'0003'
LATC4            EQU  H'0004'
LATC5            EQU  H'0005'
LATC6            EQU  H'0006'
LATC7            EQU  H'0007'


;----- LATE Bits -----------------------------------------------------
LATE3            EQU  H'0003'


;----- PIR0 Bits -----------------------------------------------------
INTF             EQU  H'0000'
IOCIF            EQU  H'0004'
TMR0IF           EQU  H'0005'


;----- PIR1 Bits -----------------------------------------------------
NVMIF            EQU  H'0000'
ACTIF            EQU  H'0002'
TMR1IF           EQU  H'0003'
TMR1GIF          EQU  H'0004'
TMR3IF           EQU  H'0005'
TMR3GIF          EQU  H'0006'
TMR2IF           EQU  H'0007'


;----- PIR2 Bits -----------------------------------------------------
TMR4IF           EQU  H'0000'
TMR6IF           EQU  H'0001'
CCP1IF           EQU  H'0002'
CCP2IF           EQU  H'0003'
NCO1IF           EQU  H'0004'
CWG1IF           EQU  H'0005'
CLC1IF           EQU  H'0006'
CLC2IF           EQU  H'0007'


;----- PIR3 Bits -----------------------------------------------------
CLC3IF           EQU  H'0000'
CLC4IF           EQU  H'0001'
TX1IF            EQU  H'0002'
RC1IF            EQU  H'0003'
TX2IF            EQU  H'0004'
RC2IF            EQU  H'0005'
SSP1IF           EQU  H'0006'
BCL1IF           EQU  H'0007'


;----- PIR4 Bits -----------------------------------------------------
SSP2IF           EQU  H'0000'
BCL2IF           EQU  H'0001'
CM1IF            EQU  H'0002'
ADIF             EQU  H'0003'
ADTIF            EQU  H'0004'
ZCDIF            EQU  H'0005'


;----- PIE0 Bits -----------------------------------------------------
INTE             EQU  H'0000'
IOCIE            EQU  H'0004'
TMR0IE           EQU  H'0005'


;----- PIE1 Bits -----------------------------------------------------
NVMIE            EQU  H'0000'
ACTIE            EQU  H'0002'
TMR1IE           EQU  H'0003'
TMR1GIE          EQU  H'0004'
TMR3IE           EQU  H'0005'
TMR3GIE          EQU  H'0006'
TMR2IE           EQU  H'0007'


;----- PIE2 Bits -----------------------------------------------------
TMR4IE           EQU  H'0000'
TMR6IE           EQU  H'0001'
CCP1IE           EQU  H'0002'
CCP2IE           EQU  H'0003'
NCO1IE           EQU  H'0004'
CWG1IE           EQU  H'0005'
CLC1IE           EQU  H'0006'
CLC2IE           EQU  H'0007'


;----- PIE3 Bits -----------------------------------------------------
CLC3IE           EQU  H'0000'
CLC4IE           EQU  H'0001'
TX1IE            EQU  H'0002'
RC1IE            EQU  H'0003'
TX2IE            EQU  H'0004'
RC2IE            EQU  H'0005'
SSP1IE           EQU  H'0006'
BCL1IE           EQU  H'0007'


;----- PIE4 Bits -----------------------------------------------------
SSP2IE           EQU  H'0000'
BCL2IE           EQU  H'0001'
CM1IE            EQU  H'0002'
ADIE             EQU  H'0003'
ADTIE            EQU  H'0004'
ZCDIE            EQU  H'0005'


;----- WDTCON Bits -----------------------------------------------------
SEN              EQU  H'0000'
CS               EQU  H'0007'
WDTPS0           EQU  H'0001'
WDTPS1           EQU  H'0002'
WDTPS2           EQU  H'0003'
WDTPS3           EQU  H'0004'
WDTPS4           EQU  H'0005'
SWDTEN           EQU  H'0000'
WDTCS            EQU  H'0007'


;----- BORCON Bits -----------------------------------------------------
BORRDY           EQU  H'0000'
SBOREN           EQU  H'0007'


;----- PCON0 Bits -----------------------------------------------------
NBOR             EQU  H'0000'
NPOR             EQU  H'0001'
NRI              EQU  H'0002'
NRMCLR           EQU  H'0003'
NRWDT            EQU  H'0004'
STKUNF           EQU  H'0006'
STKOVF           EQU  H'0007'


